---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoofWall
source: html/05cafa24-c65c-eadd-c4d4-405629e45387.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoofWall Property

Can't make roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawRoofWall { get; }
```